In [1]:
import pandas as pd

In [2]:
movies_title_akas = "C:\\Users\\559816\\Documents\\Project2\\Projet-Data-IA\\Database\\movies_title_akas.csv"

df = pd.read_csv(movies_title_akas, sep = ',')

In [3]:
missing_values = df.isna().sum()
print(missing_values)

titleId                  0
ordering                 0
title                    5
region              716550
language           2639661
types               613617
attributes         3113163
isOriginalTitle          0
dtype: int64

In [4]:
df = df.drop(columns=['ordering', 'attributes', 'language', 'types', 'isOriginalTitle'])
df.head()

     titleId           title region
0  tt0000009      Miss Jerry    NaN
1  tt0000009      Miss Jerry     AU
2  tt0000009      Miss Jerry     HU
3  tt0000009      Miss Jerry     US
4  tt0000009  Fräulein Jerry     DE

In [5]:
df = df.loc[df["region"] == "FR"]

df.head()

       titleId                          title region
20   tt0000591              L'enfant prodigue     FR
57   tt0000886                         Hamlet     FR
99   tt0001101  La Clémence d'Abraham Lincoln     FR
104  tt0001109                    L'aluminite     FR
116  tt0001122                L'auberge rouge     FR

In [6]:
df = df.drop_duplicates(subset = ["titleId"])

df.head()

       titleId                          title region
20   tt0000591              L'enfant prodigue     FR
57   tt0000886                         Hamlet     FR
99   tt0001101  La Clémence d'Abraham Lincoln     FR
104  tt0001109                    L'aluminite     FR
116  tt0001122                L'auberge rouge     FR

In [8]:
# ready to export

df.to_csv('cleaned_movies_title_akas.csv', index=False)